import './App.scss'

function App() {

  return (
    <>
      <h1>Task Manager</h1>
      {/*Форма добавления новой задачи (поля: заголовок, описание, приоритет (высокий/средний/низкий), кнопка «Добавить») - сайдбар по клику*/}
      {/*Список задач (каждая задача отображает: чекбокс done, заголовок, приоритет цветом, кнопки редактирования и удаления) - главная*/}
      {/*Панель фильтрации (кнопки: Все, Активные, Выполненные) - табы сверху*/}
      {/*Поле поиска по заголовку - под табами*/}
      {/*Счётчик оставшихся невыполненных задач - сайдбар главный*/}
      {/*Кнопка «Очистить выполненные» - сайдбар главный*/}
    </>
  );
}

export default App;